# Foundations of Computer Science Project
### Kiva Dataset
Paolo Mariani
<br>Matricola 800307

#### Import all required libraries

In [12]:
import pandas as pd
import re

#### Import all required Datasets

In [13]:
loan_lenders = pd.read_csv("kiva/loans_lenders.csv")
loan_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

### 1) Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender

The Dataset must be normalized, in each value of the column "lenders" there's a list of users which has to be normalized and split in different rows (one for each user).

In [31]:
lenders_list = loan_lenders["lenders"].str.split(",").explode()
lenders_list.head()

0          muc888
0         sam4326
0     camaran3922
0     lachheb1865
0     rebecca3499
Name: lenders, dtype: object

In [33]:
loan_lenders = pd.merge(loan_lenders, lenders_list, left_index=True, right_index=True)
loan_lenders

,loan_id,lenders_x,lenders_y
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",muc888
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",sam4326
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",camaran3922
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",lachheb1865
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",rebecca3499
...,...,...,...
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",trogdorfamily7622
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",danny6470
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",don6118
1387431,1206486,"alan5175, amy38101311",alan5175
1387431,1206486,"alan5175, amy38101311",amy38101311

To verify the normalization i do print the size of the list for the first row (index 0) and after i print the number of rows that are obtained with index 0.

In [88]:
len(loan_lenders["lenders_x"][0].str.split(","))

40

In [41]:
len(loan_lenders.loc[0])

40